<a href="https://colab.research.google.com/github/Mehadi2012/Data-Science/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Series
- Each column in a dataframe is a series

In [2]:
import pandas as pd
ages = pd.Series([19,22,30], name = "Age")
ages

0    19
1    22
2    30
Name: Age, dtype: int64

In [9]:
ages.max()

30

In [10]:
ages.min()

19

In [3]:
data_f = pd.read_csv("/content/sample_data/california_housing_train.csv") # This is how we read a csv file.
data_f.head(10) # we can display the csv file by using head function. Here the parameter 10 incates the number of row we want to display.

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0
5    -114.58     33.63  ...         3.3438             74000.0
6    -114.58     33.61  ...         2.6768             82400.0
7    -114.59     34.83  ...         1.7083             48500.0
8    -114.59     33.61  ...         2.1782             58400.0
9    -114.60     34.83  ...         2.1908             48100.0

[10 rows x 9 columns]

In [17]:
data_f.tail(5) # the tail function help us to see the last rows of the dataset. Here last 5 rows are displayed.

       longitude  latitude  ...  median_income  median_house_value
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[5 rows x 9 columns]

In [20]:
data_f.columns  # the columns function give us all the column's name of the dataset.

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

In [22]:
data_f.dtypes # the dtypes function give us the data types of all columns of the dataset.

longitude             float64
latitude              float64
housing_median_age    float64
total_rooms           float64
total_bedrooms        float64
population            float64
households            float64
median_income         float64
median_house_value    float64
dtype: object

In [24]:
data_f.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           17000 non-null  float64
 1   latitude            17000 non-null  float64
 2   housing_median_age  17000 non-null  float64
 3   total_rooms         17000 non-null  float64
 4   total_bedrooms      17000 non-null  float64
 5   population          17000 non-null  float64
 6   households          17000 non-null  float64
 7   median_income       17000 non-null  float64
 8   median_house_value  17000 non-null  float64
dtypes: float64(9)
memory usage: 1.2 MB

In [4]:
data_f["bedroom per rooms"] = data_f["total_rooms"] / data_f["total_bedrooms"]   # we have created a new column/feature in the dataset.
data_f.head(3)

   longitude  latitude  ...  median_house_value  bedroom per rooms
0    -114.31     34.19  ...             66900.0           4.374123
1    -114.47     34.40  ...             80100.0           4.024198
2    -114.56     33.69  ...             85700.0           4.137931

[3 rows x 10 columns]

In [5]:
data_f.rename(columns={"total_bedrooms": "BEDROOMS", "total_rooms": "ROOMS"}) # this is how we can rename a feature/column.

       longitude  latitude  ...  median_house_value  bedroom per rooms
0        -114.31     34.19  ...             66900.0           4.374123
1        -114.47     34.40  ...             80100.0           4.024198
2        -114.56     33.69  ...             85700.0           4.137931
3        -114.57     33.64  ...             73400.0           4.454006
4        -114.57     33.57  ...             65500.0           4.460123
...          ...       ...  ...                 ...                ...
16995    -124.26     40.58  ...            111400.0           5.626904
16996    -124.27     40.69  ...             79000.0           4.448864
16997    -124.30     41.84  ...            103600.0           5.041431
16998    -124.30     41.80  ...             85800.0           4.840580
16999    -124.35     40.54  ...             94600.0           6.066667

[17000 rows x 10 columns]

# Selecting Columns

In [7]:
df1 = data_f["population"]
df1.head(3)

0    1015.0
1    1129.0
2     333.0
Name: population, dtype: float64

In [9]:
df2 = data_f[["longitude","latitude","housing_median_age"]]
df2.head(6)

   longitude  latitude  housing_median_age
0    -114.31     34.19                15.0
1    -114.47     34.40                19.0
2    -114.56     33.69                17.0
3    -114.57     33.64                14.0
4    -114.57     33.57                20.0
5    -114.58     33.63                29.0

# Selecting Rows

In [11]:
data_f.iloc[0:6]

   longitude  latitude  ...  median_house_value  bedroom per rooms
0    -114.31     34.19  ...             66900.0           4.374123
1    -114.47     34.40  ...             80100.0           4.024198
2    -114.56     33.69  ...             85700.0           4.137931
3    -114.57     33.64  ...             73400.0           4.454006
4    -114.57     33.57  ...             65500.0           4.460123
5    -114.58     33.63  ...             74000.0           5.877119

[6 rows x 10 columns]

# Conditional Statements

In [17]:
df3 = data_f[data_f["total_rooms"] > 300] # Here, we selecting a specific column and displaying the values which are greater than 300.
df3.head()

   longitude  latitude  ...  median_house_value  bedroom per rooms
0    -114.31     34.19  ...             66900.0           4.374123
1    -114.47     34.40  ...             80100.0           4.024198
2    -114.56     33.69  ...             85700.0           4.137931
3    -114.57     33.64  ...             73400.0           4.454006
4    -114.57     33.57  ...             65500.0           4.460123

[5 rows x 10 columns]

In [25]:
df6 = data_f.loc[data_f["total_rooms"] > 300, "population"] # here we displayed the values of "population" which corresponding total_rooms has value higher than 300.
df6.head()

0    1015.0
1    1129.0
2     333.0
3     515.0
4     624.0
Name: population, dtype: float64

# Selecting Specific Rows and Columns

In [18]:
data_f.iloc[0:11, 0:5]

    longitude  latitude  housing_median_age  total_rooms  total_bedrooms
0     -114.31     34.19                15.0       5612.0          1283.0
1     -114.47     34.40                19.0       7650.0          1901.0
2     -114.56     33.69                17.0        720.0           174.0
3     -114.57     33.64                14.0       1501.0           337.0
4     -114.57     33.57                20.0       1454.0           326.0
5     -114.58     33.63                29.0       1387.0           236.0
6     -114.58     33.61                25.0       2907.0           680.0
7     -114.59     34.83                41.0        812.0           168.0
8     -114.59     33.61                34.0       4789.0          1175.0
9     -114.60     34.83                46.0       1497.0           309.0
10    -114.60     33.62                16.0       3741.0           801.0

# Calculating Mean

In [26]:
data_f["population"].mean()

1429.5739411764705

In [28]:
data_f[["population", "total_rooms"]].mean()

population     1429.573941
total_rooms    2643.664412
dtype: float64

# Calculating Median

In [29]:
data_f["population"].median()

1167.0

In [30]:
data_f[["population", "total_rooms"]].median()

population     1167.0
total_rooms    2127.0
dtype: float64

# Quantitative info of the dataset

In [31]:
data_f.describe()

          longitude      latitude  ...  median_house_value  bedroom per rooms
count  17000.000000  17000.000000  ...        17000.000000       17000.000000
mean    -119.562108     35.625225  ...       207300.912353           4.991525
std        2.005166      2.137340  ...       115983.764387           1.175120
min     -124.350000     32.540000  ...        14999.000000           1.000000
25%     -121.790000     33.930000  ...       119400.000000           4.168979
50%     -118.490000     34.250000  ...       180400.000000           4.927502
75%     -118.000000     37.720000  ...       265000.000000           5.712396
max     -114.310000     41.950000  ...       500001.000000          10.000000

[8 rows x 10 columns]

In [32]:
data_f[["total_bedrooms", "total_rooms", "population"]].describe()

       total_bedrooms   total_rooms    population
count    17000.000000  17000.000000  17000.000000
mean       539.410824   2643.664412   1429.573941
std        421.499452   2179.947071   1147.852959
min          1.000000      2.000000      3.000000
25%        297.000000   1462.000000    790.000000
50%        434.000000   2127.000000   1167.000000
75%        648.250000   3151.250000   1721.000000
max       6445.000000  37937.000000  35682.000000

# Column Category Frequency

In [34]:
data_f["housing_median_age"].value_counts()  #The value_counts() function is used to get a Series containing counts of unique values

52.0    1052
36.0     715
35.0     692
16.0     635
17.0     576
34.0     567
33.0     513
26.0     503
18.0     478
25.0     461
32.0     458
37.0     437
15.0     416
19.0     412
28.0     400
27.0     397
24.0     389
30.0     384
31.0     384
20.0     383
23.0     382
29.0     374
21.0     373
14.0     347
22.0     323
38.0     318
42.0     308
39.0     302
44.0     296
43.0     286
13.0     249
40.0     249
45.0     235
41.0     232
10.0     226
11.0     208
5.0      199
46.0     196
12.0     192
8.0      178
47.0     175
9.0      172
4.0      161
7.0      151
48.0     135
6.0      129
50.0     112
49.0     111
2.0       49
3.0       46
51.0      32
1.0        2
Name: housing_median_age, dtype: int64